3. 데이터 불러오기

In [1]:
import pandas as pd
import numpy as np

df = pd.read_stata(r'data\Dehejia_and_Wahba_1999\cps1re74.dta')
df = df.loc[df['re78']>0]
# df = df.loc[df['age'].isin(range(40,50))].loc[df['re78']>0].reset_index(drop=True)
df['earning'] = df['re78']
df['ln_earning'] = np.log(df['earning'])
df['school'] = df ['ed']
df = df[['earning', 'ln_earning', 'school','age']]
df

            earning  ln_earning  school  age
0       9930.045898    9.203321      11   37
1       3595.894043    8.187548       9   22
2      24909.449219   10.123003      12   30
3       7506.145996    8.923477      11   27
4        289.789886    5.669156       8   33
...             ...         ...     ...  ...
16172   2757.437988    7.922057      12   22
16173   6895.071777    8.838562      12   20
16174   4221.865234    8.348032      12   37
16175  13671.929688    9.523100       9   47
16176   7979.724121    8.984659      10   40

[13960 rows x 4 columns]

4. 기초통계량

In [2]:
df.describe()

            earning    ln_earning        school           age
count  13960.000000  13960.000000  13960.000000  13960.000000
mean   17091.861328      9.488726     11.990330     32.790688
std     8267.045898      0.963562      2.855998     10.903291
min        2.955453      1.083652      0.000000     16.000000
25%    10385.462891      9.248162     11.000000     24.000000
50%    18951.104492      9.849617     12.000000     31.000000
75%    25564.669922     10.148967     13.000000     41.000000
max    60307.929688     11.007219     18.000000     55.000000

In [3]:
# 교육수준별 소득
sch_none = [0]
sch_primary = range(1,7)
sch_secondary = range(7,13)
sch_post_secondary = range(13,17)
sch_higher_edu = range(17,23)

df.loc[df['school'].isin(sch_none)].mean()

earning       9262.937500
ln_earning       8.743732
school           0.000000
age             41.962963
dtype: float64

In [5]:
print('Edu none :',             df.loc[df['school'].isin(sch_none           )].mean()['earning'] )
print('Edu primary :',          df.loc[df['school'].isin(sch_primary        )].mean()['earning'] )
print('Edu secondary :',        df.loc[df['school'].isin(sch_secondary      )].mean()['earning'] )
print('Edu post_secondary :',   df.loc[df['school'].isin(sch_post_secondary )].mean()['earning'] )
print('Edu higher_edu :',       df.loc[df['school'].isin(sch_higher_edu     )].mean()['earning'] )

Edu none : 9262.9375
Edu primary : 14462.4775390625
Edu secondary : 16483.216796875
Edu post_secondary : 18471.298828125
Edu higher_edu : 19900.005859375

In [6]:
# CPI 변환
df_cpi_table = pd.read_html('https://www.minneapolisfed.org/about-us/monetary-policy/inflation-calculator/consumer-price-index-1913-')[0]
print(df_cpi_table.columns)
print(df_cpi_table.dtypes)
df_cpi_table

Index(['Year', 'Annual Average CPI(-U)',
       'Annual Percent Change  (rate of inflation)'],
      dtype='object')
Year                                            int64
Annual Average CPI(-U)                        float64
Annual Percent Change  (rate of inflation)     object
dtype: object

     Year  Annual Average CPI(-U) Annual Percent Change  (rate of inflation)
0    1913                     9.9                                        NaN
1    1914                    10.0                                       1.3%
2    1915                    10.1                                       0.9%
3    1916                    10.9                                       7.7%
4    1917                    12.8                                      17.8%
..    ...                     ...                                        ...
106  2019                   255.7                                       1.8%
107  2020                   258.8                                       1.2%
108  2021                   271.0                                       4.7%
109  2022                   292.7                                       8.0%
110  2023                   304.7                                       4.1%

[111 rows x 3 columns]

In [8]:
cpi_conversion_78_to_2023 = df_cpi_table.loc[df_cpi_table['Year'] == 2023][df_cpi_table.columns[1]].values[0] / df_cpi_table.loc[df_cpi_table['Year'] == 1978][df_cpi_table.columns[1]].values[0]
cpi_conversion_78_to_2023

4.673312883435583

In [11]:
df['earning_2023'] = df['earning'] * cpi_conversion_78_to_2023
df.describe()

            earning    ln_earning        school           age   earning_2023
count  13960.000000  13960.000000  13960.000000  13960.000000   13960.000000
mean   17091.861328      9.488726     11.990330     32.790688   79875.609375
std     8267.045898      0.963562      2.855998     10.903291   38634.488281
min        2.955453      1.083652      0.000000     16.000000      13.811755
25%    10385.462891      9.248162     11.000000     24.000000   48534.516602
50%    18951.104492      9.849617     12.000000     31.000000   88564.437500
75%    25564.669922     10.148967     13.000000     41.000000  119471.695312
max    60307.929688     11.007219     18.000000     55.000000  281837.812500